espressif/esp-idf/components/soc/esp32s31/register/soc/i2s_struct.h
/** Type of rx_recomb_dma_ch2 register
 *  I2S RX recombined-dma-channel configuration register
 */
typedef union {
    struct {
        /** rx_recomb_dma_ch2_valid : R/W; bitpos: [0]; default: 0;
         *  Set this bit to enable the adc-dma-channel.
         */
        uint32_t rx_recomb_dma_ch2_valid:1;
        /** rx_recomb_dma_ch2_style : R/W; bitpos: [4:1]; default: 0;
         *  Set this field to set the recombined-dma-channel style. If choose to use i2s
         *  extracted ch 1&3 in 4 channels, the style should be: 6'b1010.
         */
        uint32_t rx_recomb_dma_ch2_style:4;
        /** rx_recomb_dma_ch2_order : R/W; bitpos: [12:5]; default: 0;
         *  Set this field to set the recombined-dma-channel order. If choose to use the order
         *  ch3 -> ch1, the order should be: 8'd7 = {2'd0,2'd0,2'd1,2'd3}.
         */
        uint32_t rx_recomb_dma_ch2_order:8;
        /** rx_recomb_dma_ch2_eof_num : R/W; bitpos: [28:13]; default: 0;
         *  Set this field to set the receive eof byte length of the recombined-dma-channel.
         */
        uint32_t rx_recomb_dma_ch2_eof_num:16;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} i2s_rx_recomb_dma_ch2_reg_t;

/** Type of rx_recomb_dma_ch3 register
 *  I2S RX recombined-dma-channel configuration register
 */
typedef union {
    struct {
        /** rx_recomb_dma_ch3_valid : R/W; bitpos: [0]; default: 0;
         *  Set this bit to enable the adc-dma-channel.
         */
        uint32_t rx_recomb_dma_ch3_valid:1;
        /** rx_recomb_dma_ch3_style : R/W; bitpos: [4:1]; default: 0;
         *  Set this field to set the recombined-dma-channel style. If choose to use i2s
         *  extracted ch 1&3 in 4 channels, the style should be: 6'b1010.
         */
        uint32_t rx_recomb_dma_ch3_style:4;
        /** rx_recomb_dma_ch3_order : R/W; bitpos: [12:5]; default: 0;
         *  Set this field to set the recombined-dma-channel order. If choose to use the order
         *  ch3 -> ch1, the order should be: 8'd7 = {2'd0,2'd0,2'd1,2'd3}.
         */
        uint32_t rx_recomb_dma_ch3_order:8;
        /** rx_recomb_dma_ch3_eof_num : R/W; bitpos: [28:13]; default: 0;
         *  Set this field to set the receive eof byte length of the recombined-dma-channel.
         */
        uint32_t rx_recomb_dma_ch3_eof_num:16;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} i2s_rx_recomb_dma_ch3_reg_t;

/** Type of rx_pdm2pcm_conf register
 *  I2S RX configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:19;
        /** rx_pdm2pcm_en : R/W; bitpos: [19]; default: 0;
         *  1: Enable PDM2PCM RX mode. 0: DIsable.
         */
        uint32_t rx_pdm2pcm_en:1;
        /** rx_pdm_sinc_dsr_16_en : R/W; bitpos: [20]; default: 0;
         *  Configure the down sampling rate of PDM RX filter group1 module. 1: The  down
         *  sampling rate is 128. 0: down sampling rate is 64.
         */
        uint32_t rx_pdm_sinc_dsr_16_en:1;
        /** rx_pdm2pcm_amplify_num : R/W; bitpos: [24:21]; default: 1;
         *  Configure PDM RX amplify number.
         */
        uint32_t rx_pdm2pcm_amplify_num:4;
        /** rx_pdm_hp_bypass : R/W; bitpos: [25]; default: 0;
         *  I2S PDM RX bypass hp filter or not.
         */
        uint32_t rx_pdm_hp_bypass:1;
        /** rx_iir_hp_mult12_5 : R/W; bitpos: [28:26]; default: 6;
         *  The fourth parameter of PDM RX IIR_HP filter stage 2 is (504 +
         *  LP_I2S_RX_IIR_HP_MULT12_5[2:0])
         */
        uint32_t rx_iir_hp_mult12_5:3;
        /** rx_iir_hp_mult12_0 : R/W; bitpos: [31:29]; default: 7;
         *  The fourth parameter of PDM RX IIR_HP filter stage 1 is (504 +
         *  LP_I2S_RX_IIR_HP_MULT12_0[2:0])
         */
        uint32_t rx_iir_hp_mult12_0:3;
    };
    uint32_t val;
} i2s_rx_pdm2pcm_conf_reg_t;

/** Type of rx_tdm_ctrl register
 *  I2S TX TDM mode control register
 */
typedef union {
    struct {
        /** rx_tdm_pdm_chan0_en : R/W; bitpos: [0]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM or PDM channel $n. 0:  Disable, just
         *  input 0 in this channel.
         */
        uint32_t rx_tdm_pdm_chan0_en:1;
        /** rx_tdm_pdm_chan1_en : R/W; bitpos: [1]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM or PDM channel $n. 0:  Disable, just
         *  input 0 in this channel.
         */
        uint32_t rx_tdm_pdm_chan1_en:1;
        /** rx_tdm_pdm_chan2_en : R/W; bitpos: [2]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM or PDM channel $n. 0:  Disable, just
         *  input 0 in this channel.
         */
        uint32_t rx_tdm_pdm_chan2_en:1;
        /** rx_tdm_pdm_chan3_en : R/W; bitpos: [3]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM or PDM channel $n. 0:  Disable, just
         *  input 0 in this channel.
         */
        uint32_t rx_tdm_pdm_chan3_en:1;
        /** rx_tdm_pdm_chan4_en : R/W; bitpos: [4]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM or PDM channel $n. 0:  Disable, just
         *  input 0 in this channel.
         */
        uint32_t rx_tdm_pdm_chan4_en:1;
        /** rx_tdm_pdm_chan5_en : R/W; bitpos: [5]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM or PDM channel $n. 0:  Disable, just
         *  input 0 in this channel.
         */
        uint32_t rx_tdm_pdm_chan5_en:1;
        /** rx_tdm_pdm_chan6_en : R/W; bitpos: [6]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM or PDM channel $n. 0:  Disable, just
         *  input 0 in this channel.
         */
        uint32_t rx_tdm_pdm_chan6_en:1;
        /** rx_tdm_pdm_chan7_en : R/W; bitpos: [7]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM or PDM channel $n. 0:  Disable, just
         *  input 0 in this channel.
         */
        uint32_t rx_tdm_pdm_chan7_en:1;
        /** rx_tdm_chan8_en : R/W; bitpos: [8]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM channel $n. 0:  Disable, just input 0
         *  in this channel.
         */
        uint32_t rx_tdm_chan8_en:1;
        /** rx_tdm_chan9_en : R/W; bitpos: [9]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM channel $n. 0:  Disable, just input 0
         *  in this channel.
         */
        uint32_t rx_tdm_chan9_en:1;
        /** rx_tdm_chan10_en : R/W; bitpos: [10]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM channel $n. 0:  Disable, just input 0
         *  in this channel.
         */
        uint32_t rx_tdm_chan10_en:1;
        /** rx_tdm_chan11_en : R/W; bitpos: [11]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM channel $n. 0:  Disable, just input 0
         *  in this channel.
         */
        uint32_t rx_tdm_chan11_en:1;
        /** rx_tdm_chan12_en : R/W; bitpos: [12]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM channel $n. 0:  Disable, just input 0
         *  in this channel.
         */
        uint32_t rx_tdm_chan12_en:1;
        /** rx_tdm_chan13_en : R/W; bitpos: [13]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM channel $n. 0:  Disable, just input 0
         *  in this channel.
         */
        uint32_t rx_tdm_chan13_en:1;
        /** rx_tdm_chan14_en : R/W; bitpos: [14]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM channel $n. 0:  Disable, just input 0
         *  in this channel.
         */
        uint32_t rx_tdm_chan14_en:1;
        /** rx_tdm_chan15_en : R/W; bitpos: [15]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM channel $n. 0:  Disable, just input 0
         *  in this channel.
         */
        uint32_t rx_tdm_chan15_en:1;
        /** rx_tdm_tot_chan_num : R/W; bitpos: [19:16]; default: 0;
         *  The total channel number of I2S TX TDM mode.
         */
        uint32_t rx_tdm_tot_chan_num:4;
        /** rx_tdm_bits_mode_det_en : R/W; bitpos: [20]; default: 0;
         *  1: Auto detect bit mode in tdm slave mode. 0: Disable.
         */
        uint32_t rx_tdm_bits_mode_det_en:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} i2s_rx_tdm_ctrl_reg_t;

