espressif/esp-idf/components/soc/esp32s31/register/soc/i2s_struct.h
/** Group: TX status registers */
/** Type of state register
 *  I2S TX status register
 */
typedef union {
    struct {
        /** tx_idle : RO; bitpos: [0]; default: 1;
         *  1: i2s_tx is idle state. 0: i2s_tx is working.
         */
        uint32_t tx_idle:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} i2s_state_reg_t;


/** Group: ETM registers */
/** Type of etm_conf register
 *  I2S ETM configure register
 */
typedef union {
    struct {
        /** etm_tx_send_word_num : R/W; bitpos: [13:0]; default: 64;
         *  I2S ETM send x words event. When sending word number of
         *  reg_etm_tx_send_word_num[13:0], i2s will trigger an etm event.
         */
        uint32_t etm_tx_send_word_num:14;
        /** etm_rx_receive_word_num : R/W; bitpos: [27:14]; default: 64;
         *  I2S ETM receive x words event. When receiving word number of
         *  reg_etm_rx_receive_word_num[13:0], i2s will trigger an etm event.
         */
        uint32_t etm_rx_receive_word_num:14;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} i2s_etm_conf_reg_t;


/** Group: TX sync function registers */
/** Type of ideal_cnt register
 *  I2S sync counter register
 */
typedef union {
    struct {
        /** tx_ideal_cnt : R/W; bitpos: [30:0]; default: 0;
         *  tx fifo counter ideal value.
         */
        uint32_t tx_ideal_cnt:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} i2s_ideal_cnt_reg_t;

/** Type of fifo_cnt register
 *  I2S sync counter register
 */
typedef union {
    struct {
        /** tx_fifo_cnt : RO; bitpos: [30:0]; default: 0;
         *  tx fifo counter value.
         */
        uint32_t tx_fifo_cnt:31;
        /** tx_fifo_cnt_rst : WT; bitpos: [31]; default: 0;
         *  Set this bit to reset tx fifo counter.
         */
        uint32_t tx_fifo_cnt_rst:1;
    };
    uint32_t val;
} i2s_fifo_cnt_reg_t;

/** Type of bck_cnt register
 *  I2S sync counter register
 */
typedef union {
    struct {
        /** tx_bck_cnt : RO; bitpos: [30:0]; default: 0;
         *  tx bck counter value.
         */
        uint32_t tx_bck_cnt:31;
        /** tx_bck_cnt_rst : WT; bitpos: [31]; default: 0;
         *  Set this bit to reset tx bck counter.
         */
        uint32_t tx_bck_cnt_rst:1;
    };
    uint32_t val;
} i2s_bck_cnt_reg_t;

/** Type of cnt_diff register
 *  I2S sync counter register
 */
typedef union {
    struct {
        /** tx_cnt_diff : RO; bitpos: [30:0]; default: 0;
         *  tx bck counter value.
         */
        uint32_t tx_cnt_diff:31;
        /** tx_cnt_diff_rst : WT; bitpos: [31]; default: 0;
         *  Set this bit to reset fifo counter difference.
         */
        uint32_t tx_cnt_diff_rst:1;
    };
    uint32_t val;
} i2s_cnt_diff_reg_t;

/** Type of sync_sw_thres register
 *  I2S sync counter register
 */
typedef union {
    struct {
        /** tx_cnt_diff_sw_thres : R/W; bitpos: [30:0]; default: 0;
         *  tx fifo counter difference software threshold value, when difference larger than
         *  this threshold, interrupt will occur and hardware sync will not be executed.
         */
        uint32_t tx_cnt_diff_sw_thres:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} i2s_sync_sw_thres_reg_t;

/** Type of sync_hw_thres register
 *  I2S sync counter register
 */
typedef union {
    struct {
        /** tx_cnt_diff_hw_thres : R/W; bitpos: [30:0]; default: 0;
         *  tx fifo counter difference hardware threshold value, which means that only when
         *  difference larger than this threshold will hardware start hardware sync.
         */
        uint32_t tx_cnt_diff_hw_thres:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} i2s_sync_hw_thres_reg_t;

/** Type of hw_sync_conf register
 *  I2S TX hardware sync function configuration register
 */
typedef union {
    struct {
        /** tx_hw_sync_en : R/W; bitpos: [0]; default: 0;
         *  Configure whether enable i2s tx hardware sync function. 1: Enable. 0: Disable
         */
        uint32_t tx_hw_sync_en:1;
        /** tx_hw_sync_suppl_mode : R/W; bitpos: [1]; default: 0;
         *  Configure the i2s tx hardware sync supplementation mode. 1: Supplement the data
         *  configured in I2S_TX_HW_SYNC_SUPPL_DATA[31:0]. 0: Supplement the last data.
         */
        uint32_t tx_hw_sync_suppl_mode:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} i2s_hw_sync_conf_reg_t;

/** Type of hw_sync_data register
 *  I2S TX hardware sync function configuration register
 */
typedef union {
    struct {
        /** tx_hw_sync_suppl_data : R/W; bitpos: [31:0]; default: 0;
         *  Configure the i2s tx hardware sync supplementation data when
         *  I2S_TX_HW_SYNC_SUPPL_MODE is 1.
         */
        uint32_t tx_hw_sync_suppl_data:32;
    };
    uint32_t val;
} i2s_hw_sync_data_reg_t;


/** Group: Clock registers */
/** Type of clk_gate register
 *  Clock gate register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  set this bit to enable clock gate
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} i2s_clk_gate_reg_t;


/** Group: Version register */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 38813744;
         *  I2S version control register
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} i2s_date_reg_t;


typedef struct {
    uint32_t reserved_000[3];
    volatile i2s_int_raw_reg_t int_raw;
    volatile i2s_int_st_reg_t int_st;
    volatile i2s_int_ena_reg_t int_ena;
    volatile i2s_int_clr_reg_t int_clr;
    uint32_t reserved_01c;
    volatile i2s_rx_conf_reg_t rx_conf;
    volatile i2s_tx_conf_reg_t tx_conf;
    volatile i2s_rx_conf1_reg_t rx_conf1;
    volatile i2s_tx_conf1_reg_t tx_conf1;
    volatile i2s_rx_recomb_ctrl_reg_t rx_recomb_ctrl;
    volatile i2s_rx_recomb_dma_ch0_reg_t rx_recomb_dma_ch0;
    volatile i2s_rx_recomb_dma_ch1_reg_t rx_recomb_dma_ch1;
    volatile i2s_rx_recomb_dma_ch2_reg_t rx_recomb_dma_ch2;
    volatile i2s_rx_recomb_dma_ch3_reg_t rx_recomb_dma_ch3;
    volatile i2s_tx_pcm2pdm_conf_reg_t tx_pcm2pdm_conf;
    volatile i2s_tx_pcm2pdm_conf1_reg_t tx_pcm2pdm_conf1;
    volatile i2s_rx_pdm2pcm_conf_reg_t rx_pdm2pcm_conf;
    volatile i2s_rx_tdm_ctrl_reg_t rx_tdm_ctrl;
    volatile i2s_tx_tdm_ctrl_reg_t tx_tdm_ctrl;
    volatile i2s_rx_timing_reg_t rx_timing;
    volatile i2s_tx_timing_reg_t tx_timing;
    volatile i2s_lc_hung_conf_reg_t lc_hung_conf;
    volatile i2s_rxeof_num_reg_t rxeof_num;
    volatile i2s_conf_sigle_data_reg_t conf_sigle_data;
    volatile i2s_state_reg_t state;
    volatile i2s_etm_conf_reg_t etm_conf;
    volatile i2s_ideal_cnt_reg_t ideal_cnt;
    volatile i2s_fifo_cnt_reg_t fifo_cnt;
    volatile i2s_bck_cnt_reg_t bck_cnt;
    volatile i2s_cnt_diff_reg_t cnt_diff;
    volatile i2s_sync_sw_thres_reg_t sync_sw_thres;
    volatile i2s_sync_hw_thres_reg_t sync_hw_thres;
    volatile i2s_hw_sync_conf_reg_t hw_sync_conf;
    volatile i2s_hw_sync_data_reg_t hw_sync_data;
    uint32_t reserved_094[24];
    volatile i2s_destination_reg_t destination;
    volatile i2s_clk_gate_reg_t clk_gate;
    volatile i2s_date_reg_t date;
} i2s_dev_t;

extern i2s_dev_t I2S0;
extern i2s_dev_t I2S1;

#ifndef __cplusplus
_Static_assert(sizeof(i2s_dev_t) == 0x100, "Invalid size of i2s_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
